jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32Gxxx_DFP.1.1.0.pdsc
        <!-- *************************  Device 'EFM32G840F64'  ***************************** -->
        <device Dname="EFM32G840F64">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G840F64"/>
          <debug svd="SVD\EFM32G\EFM32G840F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G840F128'  ***************************** -->
        <device Dname="EFM32G840F128">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G840F128"/>
          <debug svd="SVD\EFM32G\EFM32G840F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G842'  **************************** -->
      <subFamily DsubFamily="EFM32G842">
        <feature type="Touch"         n="8"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.22"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="53"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="QFP"           n="64"/>

        <book name="Documents\EFM32G842.pdf" title="EFM32G842 Data Sheet"/>

        <!-- *************************  Device 'EFM32G842F32'  ***************************** -->
        <device Dname="EFM32G842F32">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G842F32"/>
          <debug svd="SVD\EFM32G\EFM32G842F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G842F64'  ***************************** -->
        <device Dname="EFM32G842F64">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G842F64"/>
          <debug svd="SVD\EFM32G\EFM32G842F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G842F128'  ***************************** -->
        <device Dname="EFM32G842F128">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G842F128"/>
          <debug svd="SVD\EFM32G\EFM32G842F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G880'  **************************** -->
      <subFamily DsubFamily="EFM32G880">
        <feature type="Touch"         n="16"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtBus"        n="1"       m="16"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.40"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="86"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="QFP"           n="100"/>

        <book name="Documents\EFM32G880.pdf" title="EFM32G880 Data Sheet"/>

        <!-- *************************  Device 'EFM32G880F32'  ***************************** -->
        <device Dname="EFM32G880F32">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G880F32"/>
          <debug svd="SVD\EFM32G\EFM32G880F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G880F64'  ***************************** -->
        <device Dname="EFM32G880F64">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G880F64"/>
          <debug svd="SVD\EFM32G\EFM32G880F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G880F128'  ***************************** -->
        <device Dname="EFM32G880F128">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G880F128"/>
          <debug svd="SVD\EFM32G\EFM32G880F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32G890'  **************************** -->
      <subFamily DsubFamily="EFM32G890">
        <feature type="Touch"         n="16"/>
        <feature type="USART"         n="3"/>
        <feature type="SPI"           n="3"/>
        <feature type="ExtBus"        n="1"       m="16"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="LCD"           n="1"       m="4.40"/>
        <feature type="Timer"         n="3"       m="8"               name="8Bit Pulse Counter"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="90"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="BGA"           n="112"/>

        <book name="Documents\EFM32G890.pdf" title="EFM32G890 Data Sheet"/>

        <!-- *************************  Device 'EFM32G890F32'  ***************************** -->
        <device Dname="EFM32G890F32">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G890F32"/>
          <debug svd="SVD\EFM32G\EFM32G890F32.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G890F64'  ***************************** -->
        <device Dname="EFM32G890F64">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G890F64"/>
          <debug svd="SVD\EFM32G\EFM32G890F64.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00010000"             default="1"/>
        </device>

        <!-- *************************  Device 'EFM32G890F128'  ***************************** -->
        <device Dname="EFM32G890F128">
          <compile header="Device\EFM32G\Include\em_device.h" define="EFM32G890F128"/>
          <debug svd="SVD\EFM32G\EFM32G890F128.svd"/>
          <memory id="IROM1"                start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32.FLM" start="0x00000000" size="0x00020000"             default="1"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32G">
      <description>Silicon Labs EFM32G device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32G*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32G CMSIS">
      <description>Silicon Labs EFM32G device series and CMSIS Core</description>
      <require condition="EFM32G"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32G"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32G"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
